switch (expression) {
    case value1:
      // التعابير البرمجية التي ستُطبِّق
      // عندما تُطابِق قيمةُ التعبير قيمةَ الحالة
      break;
    case value2:
      // التعابير البرمجية التي ستُطبِّق
      // عندما تُطابِق قيمةُ التعبير قيمةَ الحالة
      break;
    case valueN:
      // التعابير البرمجية التي ستُطبِّق
      // عندما تُطابِق قيمةُ التعبير قيمةَ الحالة
      break;
    default:
      // التعابير البرمجية التي ستُطبِّق
      // عندما لا تُطابِق قيمةُ التعبير أيّة حالة
      break;
  }